content/brief/logistics.md
+++
title = "Logistics"
author = ["Ben Ford"]
lastmod = 2019-03-09T10:41:11+00:00
draft = false
weight = 20
+++

General commercial info and planning info

<!--more-->


## Company details {#company-details}

Commando Development Ltd
<https://commandodev.com>

(contacts on the website)

I also own:

-   commandodevelopment.com
-   commandodev.co.uk
-   cdodev.co.uk
-   commandodeveloper.com
-   commandodevelopers.com


## Intended launch date {#intended-launch-date}

Web site is already live. I'd like to get a more on brand presence out there be
within 30 days as that's the time frame that I want to work to for beginning to
get customers


## Budget {#budget}

Limited - I want something constrained enough that I'm not totally embarrased,
but that's enough for me to start selling. After I get revenue, I'm very
prepared to plow some of that back into improving the brand and message


## Current website {#current-website}

The current website is something that I've put together as a mean to start
gathering content. I like the minimalist feel, but I want to develop a proper
band voice.

It's using the unify theme and built using bootstrap:
<https://htmlstream.com/preview/unify-v2.6/index.html>. There are various elements
available like paralax images, video carosels etc.

At the moment there has been no marketing and the site, although live, is
essentually hidden.


## Purpose of new website {#purpose-of-new-website}

The new website is intended to be where I hand my shingle out and as a primary
marketing source. It will more than likely be where I send customers to specific
landing pages and well as to capture details for marketing purposes. Over time I
will integrate things like:

-   Email address gathering (convertkit)
-   Segmentation and A/B testing (right message)
-   Consulting call booking (calendly)
-   Custom built functionality
-   SaaS apps if and when appropriate


### Audience {#audience}

The primary audience (at least at first) will be cold and warm leads who come in
through paid advertising channels. I will almost certainly want to segment them
into separate audiences. The two big divisions I forsee to start with are
technical leaders or business owners vs individual contributors or more junior
folks.

They will have a technical background and will most likely be the kinds of
people that will notice any less well executed elements. For this reason the
site will be static (for speed) served over https, and must look extremely
technically competent.

People will be sent to the site for the primary reason of growing my audience
initially - I doubt I'll be selling directly from the site to start with.


### Perception {#perception}

I'm trying to bring the ethos that we know from the corps to software
development. So:

excellence, precision, persistence, elite, pragmatic, good enough vs perfect,
continuous improvement, curiosity, performance, process, shared standards,
courage to do the right thing,


## Competitors/similar companies {#competitors-similar-companies}

I don't really have any direct competitors I don't think. There are people like
agile, change and leadership consultants like the following. But I don't know of
any one in particular doing operational excellence specifically


### Dan North {#dan-north}

<https://dannorth.net/>


### Accomplish (ex bootnecks as well) {#accomplish--ex-bootnecks-as-well}

I like the clean look these guys have
<http://www.accomplish.world/>


### Albany {#albany}

<https://www.albanyassociates.com/>


### Leadership Forces {#leadership-forces}

Rod is an ex bootneck and someone I may well partner with in future
<http://www.leadershipforces.com/>


### DRM group {#drm-group}

David is an ex bootneck selling resilience mainly to larger companies
<https://www.drmgroup.co.uk/>


### EQ Commando {#eq-commando}

Shaun is an ex bootneck, now doing emotional intelligence coaching
<https://www.eq2lead.uk/the-eq-commando>


## Inspiration {#inspiration}


### Jame Clear {#jame-clear}

I like the clean look and the content organisation
<https://jamesclear.com/>


### Double your freelancing {#double-your-freelancing}

Brennan is a master at marketing and systemising
<https://doubleyourfreelancing.com/>


### Stacking the bricks {#stacking-the-bricks}

Amy Hoy is also a master at selling digital products and courses
<https://stackingthebricks.com/>


### Cal Newport {#cal-newport}

Cal is a minimalist and productivity expert
<http://calnewport.com>


### Rob Stewart {#rob-stewart}

Ex RAF pilot. Teaches coaches marketing and systems
<http://www.robstewartglobal.com/>
